arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/m8q/m8q.cpp
#include "m8q.hpp"
#include "bsp.hpp"
#include "gpio.hpp"
#include "nrf_delay.h"
#include "rtc.hpp"
#include "error.hpp"

extern RTC *rtc;

using namespace UBX;

template <typename T>
M8QReceiver::SendReturnCode M8QReceiver::send_packet_contents(UBX::MessageClass msgClass, uint8_t id, T contents, bool expect_ack)
{
    const std::time_t timeout = 3;

    // Construct packet header
    UBX::Header header = {
        .syncChars = {UBX::SYNC_CHAR1, UBX::SYNC_CHAR2},
        .msgClass = msgClass,
        .msgId = id,
        .msgLength = sizeof(contents)
    };

    // Calculate the checksum
    uint8_t ck[2] = {0};
    uint8_t *checksum_ptr = reinterpret_cast<uint8_t *>(&header.msgClass);

    // Calculate the checksum across the msgClass, msgId and msgLength
    for (unsigned int i = 0; i < 4; i++)
    {
        ck[0] = ck[0] + checksum_ptr[i];
        ck[1] = ck[1] + ck[0];
    }

    // Calculate the checksum across the contents
    checksum_ptr = reinterpret_cast<uint8_t *>(&contents);
    for (unsigned int i = 0; i < sizeof(contents); i++)
    {
        ck[0] = ck[0] + checksum_ptr[i];
        ck[1] = ck[1] + ck[0];
    }

    m_rx_buffer.pending = false;
    m_nrf_uart_m8->send(reinterpret_cast<uint8_t *>(&header), sizeof(header));
    m_nrf_uart_m8->send(reinterpret_cast<uint8_t *>(&contents), sizeof(contents));
    m_nrf_uart_m8->send(&ck[0], sizeof(ck));

    // Wait for an ACK/NACK if we are expecting one
    if (expect_ack)
    {
        auto start_time = rtc->gettime();
        for (;;)
        {
            if (m_rx_buffer.pending)
            {
                UBX::Header *header_ptr = reinterpret_cast<UBX::Header *>(&m_rx_buffer.data[0]);
                if (header_ptr->msgClass == UBX::MessageClass::MSG_CLASS_ACK)
                {
                    if (header_ptr->msgId == UBX::ACK::ID_ACK)
                    {
                        UBX::ACK::MSG_ACK *msg_ack_ptr = reinterpret_cast<UBX::ACK::MSG_ACK *>(&m_rx_buffer.data[sizeof(UBX::Header)]);
                        if (msg_ack_ptr->clsID == msgClass && msg_ack_ptr->msgID == id)
                        {
                            //DEBUG_TRACE("GPS ACK-ACK <-");
                            return SendReturnCode::SUCCESS;
                        }
                    }
                    else if (header_ptr->msgId == UBX::ACK::ID_NACK)
                    {
                        UBX::ACK::MSG_ACK *msg_nack_ptr = reinterpret_cast<UBX::ACK::MSG_ACK *>(&m_rx_buffer.data[sizeof(UBX::Header)]);
                        if (msg_nack_ptr->clsID == msgClass && msg_nack_ptr->msgID == id)
                        {
                            DEBUG_WARN("GPS ACK-NACK <-");
                            return SendReturnCode::NACKD;
                        }
                    }
                }

                m_rx_buffer.pending = false;
            }

            if (rtc->gettime() - start_time >= timeout)
            {
                DEBUG_ERROR("GPS Timed out waiting for response");
                return SendReturnCode::RESPONSE_TIMEOUT;
            }
        }
    }

    return SendReturnCode::SUCCESS;
}

template <typename T>
M8QReceiver::SendReturnCode M8QReceiver::poll_contents_and_collect(UBX::MessageClass msgClass, uint8_t id, T &contents)
{
    const std::time_t timeout = 3;

    // Construct packet header
    UBX::Header header = {
        .syncChars = {UBX::SYNC_CHAR1, UBX::SYNC_CHAR2},
        .msgClass = msgClass,
        .msgId = id,
        .msgLength = 0
    };

    // Calculate the checksum
    uint8_t ck[2] = {0};
    uint8_t *checksum_ptr = reinterpret_cast<uint8_t *>(&header.msgClass);

    // Calculate the checksum across the msgClass, msgId and msgLength
    for (unsigned int i = 0; i < 4; i++)
    {
        ck[0] = ck[0] + checksum_ptr[i];
        ck[1] = ck[1] + ck[0];
    }

    m_rx_buffer.pending = false;
    m_nrf_uart_m8->send(reinterpret_cast<uint8_t *>(&header), sizeof(header));
    m_nrf_uart_m8->send(&ck[0], sizeof(ck));

    // Wait for the poll response
    auto start_time = rtc->gettime();
    for (;;)
    {
        if (m_rx_buffer.pending)
        {
            UBX::Header *header_ptr = reinterpret_cast<UBX::Header *>(&m_rx_buffer.data[0]);
            if (header_ptr->msgClass == msgClass && header_ptr->msgId == id)
            {
                if (m_rx_buffer.len == sizeof(T) + sizeof(UBX::Header) + sizeof(ck))
                {
                    memcpy(&contents, &m_rx_buffer.data[sizeof(UBX::Header)], sizeof(T));
                    return SendReturnCode::SUCCESS;
                }
            }

            m_rx_buffer.pending = false;
        }

        if (rtc->gettime() - start_time >= timeout)
        {
            DEBUG_ERROR("GPS Timed out waiting for response");
            return SendReturnCode::RESPONSE_TIMEOUT;
        }
    }

    return SendReturnCode::SUCCESS;
}

M8QReceiver::SendReturnCode M8QReceiver::poll_contents(UBX::MessageClass msgClass, uint8_t id)
{
    // Construct packet header
    UBX::Header header = {
        .syncChars = {UBX::SYNC_CHAR1, UBX::SYNC_CHAR2},
        .msgClass = msgClass,
        .msgId = id,
        .msgLength = 0
    };

    // Calculate the checksum
    uint8_t ck[2] = {0};
    uint8_t *checksum_ptr = reinterpret_cast<uint8_t *>(&header.msgClass);

    // Calculate the checksum across the msgClass, msgId and msgLength
    for (unsigned int i = 0; i < 4; i++)
    {
        ck[0] = ck[0] + checksum_ptr[i];
        ck[1] = ck[1] + ck[0];
    }

    m_nrf_uart_m8->send(reinterpret_cast<uint8_t *>(&header), sizeof(header));
    m_nrf_uart_m8->send(&ck[0], sizeof(ck));

    return SendReturnCode::SUCCESS;
}

M8QReceiver::M8QReceiver()
{
    m_nrf_uart_m8 = nullptr;
    m_navigation_database_len = 0;
    m_rx_buffer.pending = false;
    m_capture_messages = false;
    m_state = State::POWERED_OFF;
}

M8QReceiver::~M8QReceiver()
{
	power_off();
}

void M8QReceiver::power_off()
{

#if 0 == NO_GPS_POWER_REG
	// We can rely upon the regulator state having powered off the device
	if (State::POWERED_OFF == m_state)
		return;
#else
	// No power regulator, so we should forcibly run through a shutdown sequence e.g.,
	// to cover the scenario when the board is initially powered for the first time
#endif

	// This code should be callable even if the device is powered off already
    m_state = State::POWERED_OFF;

    DEBUG_INFO("M8QReceiver::power_off");

    if (!m_nrf_uart_m8)
        m_nrf_uart_m8 = new NrfUARTM8(UART_GPS, [this](uint8_t *data, size_t len) { reception_callback(data, len); });

    m_capture_messages = true;

    // Disable any messages so they don't interrupt our navigation database dump
    setup_uart_port();
    disable_nav_pvt_message();
    disable_nav_status_message();
    disable_nav_dop_message();

