arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/m8q/m8q.cpp
    if (m_assistnow_enable) {
    	fetch_navigation_database();
    }

    enter_shutdown_mode();

    delete m_nrf_uart_m8;
    m_nrf_uart_m8 = nullptr; // Invalidate this pointer so if we call this function again it doesn't call delete on an invalid pointer

    m_rx_buffer.pending = false;
    m_data_notification_callback = nullptr;
}

M8QReceiver::SendReturnCode M8QReceiver::print_version()
{
    // Request the receiver and software version
    poll_contents(UBX::MessageClass::MSG_CLASS_MON, UBX::MON::ID_VER);

    auto start_time = rtc->gettime();
    const std::time_t timeout = 3;
    
    for (;;)
    {
        if (m_rx_buffer.pending)
        {
            UBX::Header *header_ptr = reinterpret_cast<UBX::Header *>(&m_rx_buffer.data[0]);
            if (header_ptr->msgClass == UBX::MessageClass::MSG_CLASS_MON && header_ptr->msgId == UBX::MON::ID_VER)
            {
                uint8_t *data_ptr = &m_rx_buffer.data[sizeof(UBX::Header)];
                DEBUG_TRACE("M8QReceiver::print_version");
                DEBUG_TRACE("%.*s", 30, &data_ptr[0]);  // swVersion
                DEBUG_TRACE("%.*s", 10, &data_ptr[30]); // hwVersion
                uint32_t number_of_extensions = (header_ptr->msgLength - 40) / 30;
                for (uint32_t i = 0; i < number_of_extensions; ++i)
                {
                    DEBUG_TRACE("%.*s", 30, &data_ptr[40 + (i * 30)]); // Extension
                }
                return SendReturnCode::SUCCESS;
            }

            m_rx_buffer.pending = false;
        }

        if (rtc->gettime() - start_time >= timeout)
        {
            DEBUG_ERROR("M8QReceiver::print_version: timed out waiting for response");
            m_navigation_database_len = 0; // Invalidate the data we did receive
            return SendReturnCode::RESPONSE_TIMEOUT;
        }
    }

    return SendReturnCode::SUCCESS;
}

M8QReceiver::SendReturnCode M8QReceiver::fetch_navigation_database()
{
    const std::time_t timeout = 3;
    uint8_t *write_dst = &m_navigation_database[0];
    m_navigation_database_len = 0;
    uint32_t number_of_mga_dbd_msgs = 0;

    m_capture_messages = true;

    DEBUG_TRACE("M8QReceiver::fetch_navigation_database: requesting navigation database");

    // Request a dump of the navigation database
    m_rx_buffer.pending = false;
    poll_contents(UBX::MessageClass::MSG_CLASS_MGA, UBX::MGA::ID_DBD);

    auto last_update = rtc->gettime();
    
    for (;;)
    {
        if (m_rx_buffer.pending)
        {
            UBX::Header *header_ptr = reinterpret_cast<UBX::Header *>(&m_rx_buffer.data[0]);
            if (header_ptr->msgClass == UBX::MessageClass::MSG_CLASS_MGA)
            {
                if (header_ptr->msgId == UBX::MGA::ID_DBD)
                {
                    //DEBUG_TRACE("GPS MGA-DBD <-");

                    // Check we have enough space in our buffer to receive this
                    if (m_rx_buffer.len + 1 > sizeof(m_navigation_database) - m_navigation_database_len)
                    {
                        m_navigation_database_len = 0; // Invalidate the data we did receive
                        DEBUG_ERROR("M8QReceiver::fetch_navigation_database: received database is larger than storage buffer");
                        return SendReturnCode::DATA_OVERSIZE;
                    }

                    *write_dst++ = m_rx_buffer.len; // Preface each message with its length for easier resending
                    m_navigation_database_len++;
                    memcpy(write_dst, &m_rx_buffer.data[0], m_rx_buffer.len);
                    write_dst += m_rx_buffer.len;
                    m_navigation_database_len += m_rx_buffer.len;
                    number_of_mga_dbd_msgs++;
                    last_update = rtc->gettime();
                }
                else if (header_ptr->msgId == UBX::MGA::ID_ACK)
                {
                    UBX::MGA::MSG_ACK *msg_ack_ptr = reinterpret_cast<UBX::MGA::MSG_ACK *>(&m_rx_buffer.data[sizeof(UBX::Header)]);
                    //DEBUG_TRACE("GPS MGA-ACK <-");

                    if (msg_ack_ptr->msgPayloadStart == number_of_mga_dbd_msgs)
                    {
                        DEBUG_TRACE("M8QReceiver::fetch_navigation_database: received database of size %lu", m_navigation_database_len);
                        return SendReturnCode::SUCCESS;
                    }
                    else
                    {
                        DEBUG_ERROR("M8QReceiver::fetch_navigation_database: received less MGA-DBD packets then was expected, %lu vs %lu", number_of_mga_dbd_msgs, msg_ack_ptr->msgPayloadStart);
                        m_navigation_database_len = 0; // Invalidate the data we did receive
                        return SendReturnCode::MISSING_DATA;
                    }
                }
            }

            m_rx_buffer.pending = false;
        }

        if (rtc->gettime() - last_update >= timeout)
        {
            DEBUG_ERROR("M8QReceiver::fetch_navigation_database: timed out waiting for response");
            m_navigation_database_len = 0; // Invalidate the data we did receive
            return SendReturnCode::RESPONSE_TIMEOUT;
        }
    }

    return SendReturnCode::SUCCESS;
}

M8QReceiver::SendReturnCode M8QReceiver::send_navigation_database()
{
    if (!m_navigation_database_len)
    {
        DEBUG_TRACE("M8QReceiver::send_navigation_database: no database to send");
        return SendReturnCode::SUCCESS;
    }

    DEBUG_TRACE("M8QReceiver::send_navigation_database: sending database of size %lu", m_navigation_database_len);
    m_capture_messages = true;
    uint8_t *send_ptr = &m_navigation_database[0];
    int32_t bytes_to_process = m_navigation_database_len;
    unsigned int retries = 3;

    while (bytes_to_process > 0 && retries > 0)
    {
        // Fetch the first byte which is the length of the message we are going to send
        uint32_t send_len = *send_ptr++;
        bytes_to_process--;

        // Send the pre-recorded message
        m_rx_buffer.pending = false;
        m_nrf_uart_m8->send(send_ptr, send_len);

