arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/m8q/m8q.cpp
        //DEBUG_TRACE("GPS MGA-DBD ->");

        send_ptr += send_len;
        bytes_to_process -= send_len;

        // Wait for the ack, this will only be sent if ackAiding is set in NAVX5
        auto start_time = rtc->gettime();
        const std::time_t timeout = 1;
        for (;;)
        {
            if (m_rx_buffer.pending)
            {
                UBX::Header *header_ptr = reinterpret_cast<UBX::Header *>(&m_rx_buffer.data[0]);
                if (header_ptr->msgClass == UBX::MessageClass::MSG_CLASS_MGA && header_ptr->msgId == UBX::MGA::ID_ACK)
                {
                    //UBX::MGA::MSG_ACK *msg_ack_ptr = reinterpret_cast<UBX::MGA::MSG_ACK *>(&m_rx_buffer.data[sizeof(UBX::Header)]);
                    //DEBUG_TRACE("GPS MGA-ACK <- infoCode: %u", msg_ack_ptr->infoCode);
                	retries = 3;
                    break;
                }

                m_rx_buffer.pending = false;
            }

            if (rtc->gettime() - start_time >= timeout)
            {
            	if (--retries == 0) {
					m_navigation_database_len = 0; // Invalidate the data we did receive
					return SendReturnCode::RESPONSE_TIMEOUT;
            	} else {
            		// Reset pointers back to previous message for a retry
            		bytes_to_process += (send_len + 1);
            		send_ptr -= (send_len + 1);
            		break;
            	}
            }
        }
    }

    return SendReturnCode::SUCCESS;
}

void M8QReceiver::power_on(const GPSNavSettings& nav_settings,
		                   std::function<void(GNSSData data)> data_notification_callback = nullptr)
{
    if (m_state == State::POWERED_ON)
        return;
    
    m_state = State::POWERED_ON;

    DEBUG_INFO("M8QReceiver::power_on");

    m_data_notification_callback = data_notification_callback;
    m_capture_messages = true;
    m_assistnow_enable = nav_settings.assistnow_enable;

    if (!m_nrf_uart_m8)
        m_nrf_uart_m8 = new NrfUARTM8(UART_GPS, [this](uint8_t *data, size_t len) { reception_callback(data, len); });

    // Clear our dop and pvt message containers
    memset(&m_last_received_pvt, 0, sizeof(m_last_received_pvt));
    memset(&m_last_received_dop, 0, sizeof(m_last_received_dop));
    memset(&m_last_received_status, 0, sizeof(m_last_received_status));

    exit_shutdown_mode();
    
    SendReturnCode ret;

    ret = setup_uart_port();                  if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = setup_gnss_channel_sharing();       if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = disable_odometer();                 if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = disable_timepulse_output();         if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = setup_power_management();           if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = setup_lower_power_mode();           if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = setup_simple_navigation_settings(nav_settings); if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = setup_expert_navigation_settings(); if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = supply_time_assistance();           if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    if (m_assistnow_enable) {
		ret = send_navigation_database();         if (ret != SendReturnCode::SUCCESS)
			DEBUG_WARN("M8QReceiver::power_on: failed to send navigation database");
    }
    ret = enable_nav_pvt_message();           if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = enable_nav_status_message();        if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = enable_nav_dop_message();           if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}

    m_capture_messages = false;

    return;

POWER_ON_FAILURE:

    // Our power on has failed so ensure we leave the GPS powered down
    power_off();

    if (ret == SendReturnCode::NACKD)
        throw ErrorCode::GPS_BOOT_NACKED;
    else if (ret == SendReturnCode::RESPONSE_TIMEOUT)
        throw ErrorCode::GPS_BOOT_TIMEOUT;
    else
        throw;
}

void M8QReceiver::reception_callback(uint8_t *data, size_t len)
{
    // If we haven't booted then we need to stash the incoming messages so that we can check for ACK/NACKs whilst configuring the device
    if (m_capture_messages)
    {
        if (!m_rx_buffer.pending)
        {
            memcpy(&m_rx_buffer.data[0], data, len);
            m_rx_buffer.pending = true;
            m_rx_buffer.len = len;
        }

        m_rx_buffer.pending = true;
    }
    else
    {
        // We're looking for a pair of NAV-PVT and NAV-DOP messages so we can retrieve all the data necessary to generate a callback
        // We can use iTow to ensure both messages relate to the same position/time
        UBX::Header *header_ptr = reinterpret_cast<UBX::Header *>(&data[0]);
        if (header_ptr->msgClass == UBX::MessageClass::MSG_CLASS_NAV)
        {
            if (header_ptr->msgId == UBX::NAV::ID_PVT)
            {
                UBX::NAV::PVT::MSG_PVT *msg_pvt_ptr = reinterpret_cast<UBX::NAV::PVT::MSG_PVT *>(&data[sizeof(UBX::Header)]);
                memcpy(&m_last_received_pvt, msg_pvt_ptr, sizeof(m_last_received_pvt));

                //DEBUG_TRACE("GPS NAV-PVT <-");

                populate_gnss_data_and_callback();
            }
            else if (header_ptr->msgId == UBX::NAV::ID_DOP)
            {
                UBX::NAV::DOP::MSG_DOP *msg_dop_ptr = reinterpret_cast<UBX::NAV::DOP::MSG_DOP *>(&data[sizeof(UBX::Header)]);
                memcpy(&m_last_received_dop, msg_dop_ptr, sizeof(m_last_received_dop));

                //DEBUG_TRACE("GPS NAV-DOP <-");

                populate_gnss_data_and_callback();
            }
            else if (header_ptr->msgId == UBX::NAV::ID_STATUS)
            {
                UBX::NAV::STATUS::MSG_STATUS *msg_status_ptr = reinterpret_cast<UBX::NAV::STATUS::MSG_STATUS *>(&data[sizeof(UBX::Header)]);
                memcpy(&m_last_received_status, msg_status_ptr, sizeof(m_last_received_status));

                //DEBUG_TRACE("GPS NAV-STATUS <-");

                populate_gnss_data_and_callback();
            }
        }
    }
}

// Checks if the data we have to date is enough to generate a gnss data callback and if it is calls it
void M8QReceiver::populate_gnss_data_and_callback()
{
    if (m_last_received_pvt.fixType != UBX::NAV::PVT::FIXTYPE_NO &&    // GPS Fix must be achieved
        m_last_received_pvt.valid & UBX::NAV::PVT::VALID_VALID_DATE && // Date must be valid
        m_last_received_pvt.valid & UBX::NAV::PVT::VALID_VALID_TIME && // Time must be valid
        m_last_received_pvt.iTow == m_last_received_dop.iTow &&        // All received DOP, NAV and STATUS,
        m_last_received_status.iTow == m_last_received_dop.iTow)       // must refer to the same position
    {
        GNSSData gnss_data = 
        {
            .iTOW      = m_last_received_pvt.iTow,
            .year      = m_last_received_pvt.year,
            .month     = m_last_received_pvt.month,
            .day       = m_last_received_pvt.day,
            .hour      = m_last_received_pvt.hour,
            .min       = m_last_received_pvt.min,
            .sec       = m_last_received_pvt.sec,
            .valid     = m_last_received_pvt.valid,
            .tAcc      = m_last_received_pvt.tAcc,
            .nano      = m_last_received_pvt.nano,
            .fixType   = m_last_received_pvt.fixType,
            .flags     = m_last_received_pvt.flags,
            .flags2    = m_last_received_pvt.flags2,
            .flags3    = m_last_received_pvt.flags3,
            .numSV     = m_last_received_pvt.numSV,
            .lon       = m_last_received_pvt.lon / 10000000.0,
            .lat       = m_last_received_pvt.lat / 10000000.0,
            .height    = m_last_received_pvt.height,
            .hMSL      = m_last_received_pvt.hMSL,
            .hAcc      = m_last_received_pvt.hAcc,
            .vAcc      = m_last_received_pvt.vAcc,
            .velN      = m_last_received_pvt.velN,
            .velE      = m_last_received_pvt.velE,
            .velD      = m_last_received_pvt.velD,
            .gSpeed    = m_last_received_pvt.gSpeed,
            .headMot   = m_last_received_pvt.headMot / 100000.0f,
            .sAcc      = m_last_received_pvt.sAcc,
            .headAcc   = m_last_received_pvt.headAcc / 100000.0f,
            .pDOP      = m_last_received_dop.pDOP / 100.0f,
            .vDOP      = m_last_received_dop.vDOP / 100.0f,
            .hDOP      = m_last_received_dop.hDOP / 100.0f,
            .headVeh   = m_last_received_pvt.headVeh / 100000.0f,
            .ttff      = m_last_received_status.ttff
        };

        if (m_data_notification_callback)
            m_data_notification_callback(gnss_data);
    }
}

M8QReceiver::SendReturnCode M8QReceiver::setup_uart_port()
{
    // Disable NMEA and only allow UBX messages

