arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/m8q/m8q.cpp
	// Make sure we are running at the correct baud rate for the module
	auto ret = sync_baud_rate();
	if (ret != SendReturnCode::SUCCESS)
		return ret;

    CFG::PRT::MSG_UART uart_prt = 
    {
        .portID = CFG::PRT::PORTID_UART,
        .reserved1 = 0,
        .txReady = 0,
        .mode = CFG::PRT::MODE_CHARLEN_8BIT | CFG::PRT::MODE_PARITY_NO | CFG::PRT::MODE_STOP_BITS_1,
        .baudRate = 460800,
        .inProtoMask = CFG::PRT::PROTOMASK_UBX,
        .outProtoMask = CFG::PRT::PROTOMASK_UBX,
        .flags = 0,
        .reserved2 = {0}
    };

    //DEBUG_TRACE("GPS CFG-PRT ->");

    ret = send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_PRT, uart_prt, false);
    m_nrf_uart_m8->change_baudrate(uart_prt.baudRate);

    nrf_delay_ms(100); // Wait for the port to have changed baudrate

    return ret;
}

M8QReceiver::SendReturnCode M8QReceiver::setup_gnss_channel_sharing()
{
    SendReturnCode ret;

    CFG::GNSS::MSG_GNSS cfg_msg_cfg_gnss =
    {
        .version = 0x00,
        .numTrkChHw = 0,
        .numTrkChUse = 0xFF, // Use max number of tracking channels
        .numConfigBlocks = 7,
        .data =
        {
            {
                .gnssId = CFG::GNSS::GNSSID_GPS,
                .resTrkCh = 8,
                .maxTrkCh = 16,
                .reserved1 = 0,
                .flags = CFG::GNSS::FLAGS_GPS_L1CA | CFG::GNSS::FLAGS_ENABLE
            },
            {
                .gnssId = CFG::GNSS::GNSSID_SBAS,
                .resTrkCh = 1,
                .maxTrkCh = 3,
                .reserved1 = 0,
                .flags = CFG::GNSS::FLAGS_SBAS_L1CA
            },
            {
                .gnssId = CFG::GNSS::GNSSID_GALILEO,
                .resTrkCh = 4,
                .maxTrkCh = 8,
                .reserved1 = 0,
                .flags = CFG::GNSS::FLAGS_GALILEO_E1 | CFG::GNSS::FLAGS_ENABLE
            },
            {
                .gnssId = CFG::GNSS::GNSSID_BEIDOU,
                .resTrkCh = 8,
                .maxTrkCh = 16,
                .reserved1 = 0,
                .flags = CFG::GNSS::FLAGS_BEIDOU_B1I
            },
            {
                .gnssId = CFG::GNSS::GNSSID_IMES,
                .resTrkCh = 0,
                .maxTrkCh = 8,
                .reserved1 = 0,
                .flags = CFG::GNSS::FLAGS_IMES_L1
            },
            {
                .gnssId = CFG::GNSS::GNSSID_QZSS,
                .resTrkCh = 0,
                .maxTrkCh = 3,
                .reserved1 = 0,
                // To avoid cross-correlation issues, it is recommended that GPS and QZSS are always both enabled or both disabled
                .flags = CFG::GNSS::FLAGS_QZSS_L1CA | CFG::GNSS::FLAGS_ENABLE
            },
            {
                .gnssId = CFG::GNSS::GNSSID_GLONASS,
                .resTrkCh = 8,
                .maxTrkCh = 14,
                .reserved1 = 0,
                .flags = CFG::GNSS::FLAGS_GLONASS_L1 | CFG::GNSS::FLAGS_ENABLE
            }
        }
    };

    //DEBUG_TRACE("GPS CFG-GNSS ->");
    ret = send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_GNSS, cfg_msg_cfg_gnss);
    if (ret != SendReturnCode::SUCCESS)
        return ret;

    // Applying the GNSS system configuration takes some time. After issuing UBX-
    // CFG-GNSS, wait first for the acknowledgement from the receiver and then 0.5
    // seconds before sending the next command
    nrf_delay_ms(500);

    // Save the configuration up until this point into RAM so that it is retained through the CFG-RST hardware reset
    //DEBUG_TRACE("GPS CFG-CFG ->");
    CFG::CFG::MSG_CFG cfg_msg_cfg_cfg =
    {
        .clearMask   = 0,
        .saveMask    = CFG::CFG::CLEARMASK_IOPORT   |
                       CFG::CFG::CLEARMASK_MSGCONF  |
                       CFG::CFG::CLEARMASK_INFMSG   |
                       CFG::CFG::CLEARMASK_NAVCONF  |
                       CFG::CFG::CLEARMASK_RXMCONF  |
                       CFG::CFG::CLEARMASK_SENCONF  |
                       CFG::CFG::CLEARMASK_RINVCONF |
                       CFG::CFG::CLEARMASK_ANTCONF  |
                       CFG::CFG::CLEARMASK_LOGCONF  |
                       CFG::CFG::CLEARMASK_FTSCONF,
        .loadMask    = 0,
        .deviceMask  = CFG::CFG::DEVMASK_BBR,
    };

    ret = send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_CFG, cfg_msg_cfg_cfg);
    if (ret != SendReturnCode::SUCCESS)
        return ret;

    // If Galileo is enabled, UBX-CFG-GNSS must be followed by UBX-CFG-RST with resetMode set to Hardware reset
    //DEBUG_TRACE("GPS CFG-RST ->");
    CFG::RST::MSG_RST cfg_msg_cfg_rst =
    {
        .navBbrMask = 0x0000,
        .resetMode = CFG::RST::RESETMODE_HARDWARE_RESET_IMMEDIATE,
        .reserved1 = 0,
    };

    ret = send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_RST, cfg_msg_cfg_rst, false); // No acknowledge from this message

    // Wait for the device to have reset
    nrf_delay_ms(100); // This is an estimated value

    return ret;
}

M8QReceiver::SendReturnCode M8QReceiver::setup_power_management()
{
    CFG::PM2::MSG_PM2 cfg_msg_cfg_pm2 =
    {
        .version = 0x02,
        .reserved1 = 0,
        .maxStartupStateDur = 0,
        .reserved2 = 0,
        .flags = CFG::PM2::FLAGS_DONOTENTEROFF | CFG::PM2::FLAGS_UPDATEEPH | CFG::PM2::FLAGS_MODE_CYCLIC | CFG::PM2::FLAGS_LIMITPEAKCURR_DISABLED,
        .updatePeriod = 1000,
        .searchPeriod = 10000,
        .gridOffset = 0,
        .onTime = 0,
        .minAcqTime = 300,
        .reserved3 = {0},
        .extintInactivityMs = 0
    };

    //DEBUG_TRACE("GPS CFG-PM2 ->");

    return send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_PM2, cfg_msg_cfg_pm2);
}

M8QReceiver::SendReturnCode M8QReceiver::setup_lower_power_mode()
{
    CFG::RXM::MSG_RXM cfg_msg_cfg_rxm =
    {
        .reserved1 = 0,
        .lpMode = CFG::RXM::CONTINUOUS_MODE
    };

    //DEBUG_TRACE("GPS CFG-RXM ->");

    return send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_RXM, cfg_msg_cfg_rxm);
}

