arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/m8q/m8q.cpp
M8QReceiver::SendReturnCode M8QReceiver::disable_nav_status_message()
{
    CFG::MSG::MSG_MSG cfg_msg_nav_dop =
    {
        .msgClass = MessageClass::MSG_CLASS_NAV,
        .msgID = NAV::ID_STATUS,
        .rate = 0
    };

    //DEBUG_TRACE("GPS CFG-MSG ->");

    return send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_MSG, cfg_msg_nav_dop);
}

M8QReceiver::SendReturnCode M8QReceiver::sync_baud_rate()
{
#if 0 == NO_GPS_POWER_REG
	// Power regulator present so just set to initial baud rate
    m_nrf_uart_m8->change_baudrate(9600);
    return SendReturnCode::SUCCESS;
#else

    std::array<unsigned int, 2> baud_rate = { 460800, 9600 };

    for (unsigned int i = 0; i < baud_rate.size(); i++)
    {
    	/* Employ two attempts, the first can be used to wake-up the device */
    	for (unsigned int j = 0; j < 2; j++)
    	{
    		m_nrf_uart_m8->change_baudrate(baud_rate.at(i));

    		// This message forces a ACKNAK response
    		CFG::MSG::MSG_MSG_NORATE cfg_msg_invalid =
    	    {
    	        .msgClass = MessageClass::MSG_CLASS_BAD,
    	        .msgID = 0,
    	    };

    	    if (SendReturnCode::NACKD == send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_MSG, cfg_msg_invalid))
    	    	return SendReturnCode::SUCCESS;
    	}
    }

    return SendReturnCode::RESPONSE_TIMEOUT;

#endif
}

M8QReceiver::SendReturnCode M8QReceiver::enter_shutdown_mode()
{
#if 0 == NO_GPS_POWER_REG
    // Disable the power supply for the GPS
    GPIOPins::clear(BSP::GPIO::GPIO_GPS_PWR_EN);
#else
    RXM::MSG_PMREQ rxm_pmreq =
    {
    	.version = 0,
        .reserved1 = {0,0,0},
        .duration = 0,
        .flags = RXM::PMREQFlags::BACKUP,
        .wakeupSources = RXM::PMREQWakeupSources::UARTRX
    };

    (void)send_packet_contents(MessageClass::MSG_CLASS_RXM, RXM::ID_PMREQ, rxm_pmreq, false);
#endif

    return SendReturnCode::SUCCESS;
}

M8QReceiver::SendReturnCode M8QReceiver::exit_shutdown_mode()
{
#if 0 == NO_GPS_POWER_REG
    // Enable the power supply for the GPS
    GPIOPins::set(BSP::GPIO::GPIO_GPS_PWR_EN);
    nrf_delay_ms(1000); // Necessary to allow the device to boot
#else
	// No action needed -- we rely upon the baud synchronisation to wake-up the device
#endif

    return SendReturnCode::SUCCESS;
}
